src/cf/База1/Enums/СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКПолучению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/База1/Documents/ЗаявкаНаОбеспечениеТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОбеспечениеТМЦ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/База1/Catalogs/ИсходящиеСообщенияВRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИсходящиеСообщенияВRMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОбеспечениеТМЦ</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/База1/Catalogs/НастройкиПодключенияRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияRMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/База1/CommonModules/ОбщийМодуль/Ext/Module.bsl
Процедура ЗаписьСправоничкаПриЗаписи(Источник, Отказ) Экспорт
	Если Справочники.ИсходящиеСообщенияВRMQ.НайтиПоРеквизиту("Источник", Источник.ссылка) = Справочники.ИсходящиеСообщенияВRMQ.ПустаяСсылка() Тогда
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаОбеспечениеТМЦ") Тогда
			Если Источник.Статус = перечисления.СтатусыЗаявки.Согласовано Тогда
				НовоеСообщение = Справочники.ИсходящиеСообщенияВRMQ.СоздатьЭлемент();
				НовоеСообщение.Источник = Источник.Ссылка; 
				ЗаписьJSON = новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Источник.Ссылка.ПолучитьОбъект()); 
		       	НовоеСообщение.ТекстСообщения = ЗаписьJSON.Закрыть();                
				НовоеСообщение.ИмяОчереди = "order"; 
				НомерСообщения = ПолучитьНомер();
				НовоеСообщение.Наименование = "Сообщение " + НомерСообщения;
				НовоеСообщение.Записать();
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда 
			НовоеСообщение = Справочники.ИсходящиеСообщенияВRMQ.СоздатьЭлемент();
			НовоеСообщение.Источник = Источник.Ссылка; 
			ЗаписьJSON = новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Источник.Ссылка.ПолучитьОбъект()); 
			НовоеСообщение.ТекстСообщения = ЗаписьJSON.Закрыть();                
			НовоеСообщение.ИмяОчереди = "RRI"; 
			НомерСообщения = ПолучитьНомер();
			НовоеСообщение.Наименование = "Сообщение " + НомерСообщения;
			НовоеСообщение.Записать();
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Организация") Тогда 
			НовоеСообщение = Справочники.ИсходящиеСообщенияВRMQ.СоздатьЭлемент();
			НовоеСообщение.Источник = Источник.Ссылка; 
			ЗаписьJSON = новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Источник.Ссылка.ПолучитьОбъект()); 
			НовоеСообщение.ТекстСообщения = ЗаписьJSON.Закрыть();                
			НовоеСообщение.ИмяОчереди = "Org"; 
			НомерСообщения = ПолучитьНомер();
			НовоеСообщение.Наименование = "Сообщение " + НомерСообщения;
			НовоеСообщение.Записать();
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Подразделение") Тогда 
			НовоеСообщение = Справочники.ИсходящиеСообщенияВRMQ.СоздатьЭлемент();
			НовоеСообщение.Источник = Источник.Ссылка; 
			ЗаписьJSON = новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Источник.Ссылка.ПолучитьОбъект()); 
			НовоеСообщение.ТекстСообщения = ЗаписьJSON.Закрыть();                
			НовоеСообщение.ИмяОчереди = "Str"; 
			НомерСообщения = ПолучитьНомер();
			НовоеСообщение.Наименование = "Сообщение " + НомерСообщения;
			НовоеСообщение.Записать();
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователь") Тогда 
			НовоеСообщение = Справочники.ИсходящиеСообщенияВRMQ.СоздатьЭлемент();
			НовоеСообщение.Источник = Источник.Ссылка; 
			ЗаписьJSON = новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Источник.Ссылка.ПолучитьОбъект()); 
			НовоеСообщение.ТекстСообщения = ЗаписьJSON.Закрыть();                
			НовоеСообщение.ИмяОчереди = "User"; 
			НомерСообщения = ПолучитьНомер();
			НовоеСообщение.Наименование = "Сообщение " + НомерСообщения;
			НовоеСообщение.Записать();
        ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Склад") Тогда 
			НовоеСообщение = Справочники.ИсходящиеСообщенияВRMQ.СоздатьЭлемент();
			НовоеСообщение.Источник = Источник.Ссылка; 
			ЗаписьJSON = новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Источник.Ссылка.ПолучитьОбъект()); 
			НовоеСообщение.ТекстСообщения = ЗаписьJSON.Закрыть();                
			НовоеСообщение.ИмяОчереди = "Store"; 
			НомерСообщения = ПолучитьНомер();
			НовоеСообщение.Наименование = "Сообщение " + НомерСообщения;
			НовоеСообщение.Записать();
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры

Функция получитьНомер()  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходящиеСообщенияВRMQ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсходящиеСообщенияВRMQ КАК ИсходящиеСообщенияВRMQ";
	Возврат Запрос.Выполнить().Выгрузить().Количество() + 1;
КонецФункции

Процедура ОтправкаСообщенийRMQ() Экспорт  
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ОтправитьСообщениеКлиентСервер(КлиентКомпоненты);
КонецПроцедуры

&НаСервере
Функция ПолучитьКомпонентуСервер()
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер();
		ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции


Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ОтправитьСообщениеКлиентСервер(КлиентКомпоненты)
	
	НастройкаПодключения = Справочники.НастройкиПодключенияRMQ.НайтиПоНаименованию("Основное");
	Попытка
		КлиентКомпоненты.Connect(
			НастройкаПодключения.Адрес,
			НастройкаПодключения.Порт,
			НастройкаПодключения.Логин,
			НастройкаПодключения.Пароль,
			НастройкаПодключения.ВиртуальныйХост);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходящиеСообщенияВRMQ.Ссылка КАК Ссылка,
		|	ИсходящиеСообщенияВRMQ.ВерсияДанных КАК ВерсияДанных,
		|	ИсходящиеСообщенияВRMQ.ПометкаУдаления КАК ПометкаУдаления,
		|	ИсходящиеСообщенияВRMQ.Код КАК Код,
		|	ИсходящиеСообщенияВRMQ.Наименование КАК Наименование,
		|	ИсходящиеСообщенияВRMQ.Отправлено КАК Отправлено,
		|	ИсходящиеСообщенияВRMQ.ИмяОчереди КАК ИмяОчереди,
		|	ИсходящиеСообщенияВRMQ.Источник КАК Источник,
		|	ИсходящиеСообщенияВRMQ.ТекстСообщения КАК ТекстСообщения,
		|	ИсходящиеСообщенияВRMQ.Предопределенный КАК Предопределенный,
		|	ИсходящиеСообщенияВRMQ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ИсходящиеСообщенияВRMQ КАК ИсходящиеСообщенияВRMQ
		|ГДЕ
		|	ИсходящиеСообщенияВRMQ.ПометкаУдаления = ЛОЖЬ
		|	И ИсходящиеСообщенияВRMQ.Отправлено = ЛОЖЬ";
		
		ТаблицаСообщений = Запрос.Выполнить().Выгрузить();
		Для каждого ИсхСообщение из ТаблицаСообщений Цикл
			
			ИмяОчереди        = ИсхСообщение.ИмяОчереди;
			ТекстСообщения    = ИсхСообщение.ТекстСообщения;
			
			
			КлиентКомпоненты.BasicPublish(
				имяОчереди,
				ИмяОчереди,
				ТекстСообщения,
				1,
				Ложь); 
	        ОтпрСообщение = ИсхСообщение.Ссылка.ПолучитьОбъект();
			ОтпрСообщение.Отправлено = Истина;
			ОтпрСообщение.Записать();
		КонецЦикла;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Сообщение успешно отправлено!");
КонецПроцедуры


Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(Новый УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'"));
КонецПроцедуры

Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("ВнешняяКомпонента");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции   

&НаСервере
Процедура ПрочитатьСообщениеСервер() Экспорт
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты)
	НастройкаПодключения = Справочники.НастройкиПодключенияRMQ.НайтиПоНаименованию("Основное");
	
	Попытка
		КлиентКомпоненты.Connect(
			НастройкаПодключения.Адрес,
			НастройкаПодключения.Порт,
			НастройкаПодключения.Логин,
			НастройкаПодключения.Пароль,
			НастройкаПодключения.ВиртуальныйХост);
		
		
		
		Попытка
			// обновить статус заявки
			ИмяОчереди = "order2";
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
		    ОтветноеСообщение = "";
			Пока КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл
				КлиентКомпоненты.BasicAck();
				ОбновитьЗаявку(ОтветноеСообщение);
			КонецЦикла;
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьЗаявку(ОтветноеСообение)
	КлючЗначение = СтрРазделить(ОтветноеСообение,",");
	Ref       = СокрЛП(Сред (КлючЗначение[0],25,36));
	Status    = Сред (КлючЗначение[8],14,СтрДлина(КлючЗначение[8])-14);
	ДокЗаявка = Документы.ЗаявкаНаОбеспечениеТМЦ.ПолучитьСсылку(Новый УникальныйИдентификатор(Ref)).ПолучитьОбъект();
	ДокЗаявка.Статус  = Перечисления.СтатусыЗаявки[Status];
	ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
